#+name: package
| name       |
|------------|
| numpy      |
| matplotlib |
| input_data |

#+name: hpara
| batch_size | n_batch | keep_prob |
|            |         |           |

#+name: graph-head
| X_shape | y_shape |
|---------+---------|
|         |         |
|         |         |



#+name: graph-body
| layer_num | l-type | layer-input | W | b | cell | max_time | ksize | strides | padding | layer_output | reshape |
|-----------+--------+-------------+---+---+------+----------+-------+---------+---------+--------------+---------|
|         1 | fcnn   |             |   |   |      |          |       |         |         |              |         |
|         2 | fcnn   |             |   |   |      |          |       |         |         |              |         |
|           |        |             |   |   |      |          |       |         |         |              |         |

l-type -> W,b,layer-input

W,b: type, shape, init, summary

cell for rnn: cell_type, cell_size

max_time for rnn: max length of a sequence

ksize for pooling

strides for conv2d, pooling

padding for conv2d, pooling

#+name: tbl-graph-tail
| err_fn | result | loss_fn | loss_summary | initializer | optimizer | saver | merged_summary |
|--------+--------+---------+--------------+-------------+-----------+-------+----------------|
|    2   |        |         |              |             |           |       |                |


  #+name: square_err
  #+header: :var err_code=tbl-graph-tail
  #+BEGIN_SRC python :tangle yes :exports code :results output drawer :prologue
  print(err_code[0][0])
  #+END_SRC

  #+RESULTS: square_err
  :RESULTS:
  2
  :END:
